{
	"app": {
		"title": "Odkryj najbardziej niezwykłe święta na świecie"
	},
	"nav": {
		"random": "Losowe",
		"upcoming": "Nadchodzące"
	},
	"holiday": {
		"celebrationDay": "Dzień Celebracji",
		"international": "Międzynarodowe",
		"noHolidaysFound": "Nie znaleziono świąt na ten dzień."
	},
	"footer": {
		"copyright": "Wszelkie prawa zastrzeżone.",
		"privacyPolicy": "Polityka Prywatności"
	},
	"error": {
		"title": "Nie można załadować treści",
		"fetchFailed": "Występują trudności z pobraniem informacji o świętach. Sprawdź połączenie i spróbuj ponownie.",
		"connectionError": "Nie można nawiązać połączenia z serwerem. Sprawdź połączenie internetowe i spróbuj ponownie.",
		"databaseError": "Wystąpił błąd podczas dostępu do bazy danych świąt. Nasz zespół został powiadomiony i pracuje nad rozwiązaniem problemu."
	},
	"notFound": {
		"title": "Strona nie znaleziona",
		"message": "Strona, której szukasz, nie istnieje lub została przeniesiona. Sprawdź adres URL lub wróć do strony głównej.",
		"goHome": "Przejdź do strony głównej"
	},
	"privacy": {
		"title": "Polityka prywatności aplikacji Ferrio",
		"effectiveDate": "Data wejścia w życie: 13 października 2025",
		"s1Title": "1. Administrator danych",
		"s1p1": "Administratorem danych osobowych jest Andrzej Chmiel, wydawca aplikacji Ferrio.",
		"s1p2": "Kontakt: poprzez formularz zgłoszeń w aplikacji.",
		"s2Title": "2. Zakres przetwarzanych danych",
		"s2p1": "Aplikacja Ferrio przetwarza jedynie adres e-mail użytkownika w przypadku logowania za pomocą konta Google.",
		"s2p2": "Adres e-mail jest używany wyłącznie do:",
		"s2i1": "przypisania raportów (zgłoszeń błędów lub propozycji świąt) do konta użytkownika,",
		"s2i2": "ewentualnego zablokowania konta w przypadku nadużyć (np. spamu).",
		"s2p3": "W przypadku logowania anonimowego żadne dane osobowe nie są zbierane.",
		"s3Title": "3. Źródło danych i miejsce przechowywania",
		"s3p1": "Dane są przetwarzane w usługach Firebase (Google LLC).",
		"s3p2": "Identyfikatory kont użytkowników są przechowywane dodatkowo na serwerze administratora (OVH, UE) w celu powiązania raportów z kontem.",
		"s4Title": "4. Raporty użytkowników",
		"s4p1": "Użytkownicy mogą wysyłać zgłoszenia błędów lub propozycje nowych świąt.",
		"s4p2": "Treść raportu może zawierać dane osobowe podane dobrowolnie przez użytkownika – administrator nie prosi o takie dane i nie wykorzystuje ich do innych celów.",
		"s5Title": "5. Cele i podstawa przetwarzania",
		"s5p1": "Dane są przetwarzane wyłącznie w celu:",
		"s5i1": "obsługi konta użytkownika,",
		"s5i2": "umożliwienia przypisania raportów,",
		"s5i3": "zapobiegania nadużyciom.",
		"s5p2": "Podstawą prawną przetwarzania danych jest prawnie uzasadniony interes administratora (art. 6 ust. 1 lit. f RODO).",
		"s6Title": "6. Udostępnianie danych",
		"s6p1": "Dane nie są przekazywane osobom trzecim, z wyjątkiem usług Firebase, które działają jako podmiot przetwarzający dane zgodnie z regulaminem Google.",
		"s7Title": "7. Okres przechowywania",
		"s7p1": "Dane są przechowywane tak długo, jak użytkownik korzysta z aplikacji.",
		"s7p2": "Konto anonimowe można usunąć przez wyczyszczenie danych aplikacji.",
		"s7p3": "Konto Google można odłączyć w ustawieniach Google.",
		"s8Title": "8. Prawa użytkownika",
		"s8p1": "Użytkownik ma prawo do:",
		"s8i1": "dostępu do swoich danych,",
		"s8i2": "żądania ich usunięcia, sprostowania lub ograniczenia przetwarzania,",
		"s8i3": "wniesienia sprzeciwu wobec przetwarzania,",
		"s8i4": "wniesienia skargi do Prezesa Urzędu Ochrony Danych Osobowych.",
		"s9Title": "9. Bezpieczeństwo",
		"s9p1": "Dane są chronione zgodnie z obowiązującymi standardami bezpieczeństwa Google Firebase.",
		"s10Title": "10. Zmiany w polityce prywatności",
		"s10p1": "Administrator może wprowadzać zmiany w niniejszej polityce, a nowa wersja będzie publikowana w aplikacji i na stronie ferrio.app."
	}
}
